#+TITLE:      2020-12

**** 代码
#+begin_src js
  const cost = [10,15,20];
  const minCostClimbingStairs = (cost) => {
      const n = cost.length;
      const dp = new Array(n + 1);
      dp[0] = dp[1] = 0;
      for (let i = 2; i <= n; i++) {
          dp[i] = Math.min(dp[i - 1] + cost[i - 1], dp[i - 2] + cost[i - 2]);
      }
      return dp[n];
  };
  return minCostClimbingStairs(cost);
#+end_src

#+RESULTS:
: 15

**** 代码
#+begin_src js
  const cost = [10, 15, 20, 10, 20, 30, 1];
  const minCostClimbingStairs = (Cost) => {
      const n = cost.length;
      let prev = 0;
      let curr = 0;
      for (let i = 2; i <= n; i++) {
          let next = Math.min(curr + cost[i - 1], prev + cost[i - 2]);
          prev = curr;
          curr = next;
      }
      return curr;
  };
  return minCostClimbingStairs(cost);
#+end_src

#+RESULTS:
: 46

**** 代码
#+begin_src js
  const s = "loveleetcode";
  const firstUniqChar = (s) => {
      const position = new Map();
      for (let i of s) {
          if (position.has(i)) {
              position.set(i, position.get(i) + 1);
          } else {
              position.set(i, 1);
          }
      }
      for (let i = 0; i < s.length; i++) {
          if (position.get(s[i]) === 1) return i;
      }
      return -1;
  };

  return firstUniqChar(s);
#+end_src

#+RESULTS:
: 2

**** 代码
#+begin_src js
  const s = "loveleetcode";
  const firstUniqChar = (s) => {
      for (let i = 0; i < s.length; i++) {
          if (s.indexOf(s[i]) === s.lastIndexOf(s[i])) {
              return i;
          }
      }
      return -1;
  };

  return firstUniqChar(s);
#+end_src

#+RESULTS:
: 2

*** 代码
#+begin_src js
  const ratings = [1, 0, 2];
  const candy = (ratings) => {
      const n = ratings.length;
      const left = Array(n).fill(1);
      for (let i = 0; i < n; i++) {
          if (i > 0 && ratings[i] > ratings[i - 1]) {
              left[i] = left[i - 1] + 1;
          } else {
              left[i] = 1;
          }
      }
      let right = 0,
          result = 0;
      for (let i = n - 1; i >= 0; i--) {
          if (i < n - 1 && ratings[i] > ratings[i + 1]) {
              right++;
          } else {
              right = 1;
          }
          result += Math.max(left[i], right);
      }
      return result;
  };
  return candy(ratings);
#+end_src

#+RESULTS:
: 5

